app/Http/Controllers/Controller.php

select * from `langs` where `lang` is null and `is_active` = 1 limit 1
---
    public function getLanguage(Request $request){

      $lang =   $request->header('X-localization');

      if($lang == 'fil' || $lang == 'fi'){
          $lang = 'tl';
      }
      if($lang == 'en'){
          return null;
      }

      return Lang::where('lang', $lang)->where('is_active', 1)->first();