app/Http/Controllers/admin/DashboardController.php

    public function dashboardView()
    {

        $totalUsers = User::withTrashed()->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->where('profile_pic', '!=', null)
            ->count();

        $bannedUsers = User::withTrashed()->with('banned')->whereHas('banned',function($query){
            $query->where('time_banned_for', '>=', Carbon::now())->orwhere('banned_forever',1);
        })
            ->whereHas('roles', function ($query) {
                $query->where('name', 'User');
            })
            ->where('profile_pic', '!=', null)
            ->count();
        $deletedUsers = User::onlyTrashed()->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->where('profile_pic', '!=', null)
            ->count();
//        $totalActiveUsers =$totalUsers-($bannedUsers+$deletedUsers);
        $totalActiveUsers = User::withTrashed()->with('banned')->whereDoesntHave('banned',function ($query){
            $query->where('time_banned_for', '>=', Carbon::now())->orwhere('banned_forever',1);
        })
            ->whereHas('roles', function ($query) {
                $query->where('name', 'User');
            })
            ->where('profile_pic', '!=', null)
            ->where('deleted_at', '=', null)
            ->count();
        $todayUsers = User::withTrashed()->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->whereDate('created_at', Carbon::today())->count();
        $totalBS = User::with(['subscription' => function ($query) {
            $query->where('shortcode', 'BS');
        }])->whereHas('subscription', function ($query) {
            $query->where('shortcode', 'BS')->where('valid_till', '>', Carbon::now());
        })->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->count();

        $totalVIP = User::with(['subscription' => function ($query) {
            $query->where('shortcode', 'VIP');
        }])->whereHas('subscription', function ($query) {
            $query->where('shortcode', 'VIP')->where('valid_till', '>', Carbon::now());
        })->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->count();

        $totalCustom = User::with(['subscription' => function ($query) {
            $query->where('shortcode', 'CUSTOM');
        }])->whereHas('subscription', function ($query) {
            $query->where('shortcode', 'CUSTOM')->where('valid_till', '>', Carbon::now());
        })->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->count();

        $totalGAM = $totalUsers - ($totalBS + $totalVIP);

        $latestFive = User::with('country')->whereHas('roles', function ($query) {
            $query->where('name', 'User');
        })->orderBy('created_at', 'DESC')
            ->limit(5)
            ->get();
        $onlineUsers = User::where('is_online', 1)->where('profile_pic','!=',null)->where('deleted_at',null)->count();
        $convertionRate = AppSetting::where('shortcode', 'STU')->first()->value2;
        $pendingPayable = Withdrawal::where('is_approved', 0)->sum('coins');
        $pendingPayableConvertions = Withdrawal::where('is_approved', 0)->sum('amount');
        $approvedPayable = Withdrawal::where('is_approved', 1)->sum('coins');
        $approvedPayableConvertions =Withdrawal::where('is_approved', 1)->sum('amount');
        $declinedPayable = Withdrawal::where('is_approved', -1)->sum('coins');
        $declinedPayableConvertions = Withdrawal::where('is_approved', -1)->sum('amount');
        $totalearned = User::sum('silver_coin');
        $totalearnedConvertions = $totalearned * $convertionRate;
        $totalearned +=Withdrawal::sum('coins');
        $totalearnedConvertions +=Withdrawal::sum('amount');
        $totalpayable = User::sum('silver_coin');
---
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `profile_pic` is not null
select count(*) as aggregate from `users` where exists (select * from `banned_users` where `users`.`id` = `banned_users`.`banned_user` and (`time_banned_for` >= '2022-04-13 15:54:17' or `banned_forever` = 1)) and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `profile_pic` is not null
select count(*) as aggregate from `users` where `users`.`deleted_at` is not null and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `profile_pic` is not null
select count(*) as aggregate from `users` where not exists (select * from `banned_users` where `users`.`id` = `banned_users`.`banned_user` and (`time_banned_for` >= '2022-04-13 15:54:17' or `banned_forever` = 1)) and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `profile_pic` is not null and `deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and date(`created_at`) = '2022-04-13'
select count(*) as aggregate from `users` where exists (select * from `subscriptions` inner join `user_subscriptions` on `subscriptions`.`id` = `user_subscriptions`.`subscription_id` where `users`.`id` = `user_subscriptions`.`user_id` and `shortcode` = 'BS' and `valid_till` > '2022-04-13 15:54:17') and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `subscriptions` inner join `user_subscriptions` on `subscriptions`.`id` = `user_subscriptions`.`subscription_id` where `users`.`id` = `user_subscriptions`.`user_id` and `shortcode` = 'VIP' and `valid_till` > '2022-04-13 15:54:17') and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `subscriptions` inner join `user_subscriptions` on `subscriptions`.`id` = `user_subscriptions`.`subscription_id` where `users`.`id` = `user_subscriptions`.`user_id` and `shortcode` = 'CUSTOM' and `valid_till` > '2022-04-13 15:54:17') and exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `users`.`deleted_at` is null
select * from `countries` where `countries`.`id` in (1, 167)
select * from `users` where exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `users`.`deleted_at` is null order by `created_at` desc limit 5
select count(*) as aggregate from `users` where `is_online` = 1 and `profile_pic` is not null and `deleted_at` is null and `users`.`deleted_at` is null
select * from `app_settings` where `shortcode` = 'STU' limit 1
select sum(`coins`) as aggregate from `withdrawals` where `is_approved` = 0
select sum(`amount`) as aggregate from `withdrawals` where `is_approved` = 0
select sum(`coins`) as aggregate from `withdrawals` where `is_approved` = 1
select sum(`amount`) as aggregate from `withdrawals` where `is_approved` = 1
select sum(`coins`) as aggregate from `withdrawals` where `is_approved` = -1
select sum(`amount`) as aggregate from `withdrawals` where `is_approved` = -1
select sum(`silver_coin`) as aggregate from `users` where `users`.`deleted_at` is null
select sum(`coins`) as aggregate from `withdrawals`
select sum(`amount`) as aggregate from `withdrawals`

        $totalpayable +=$pendingPayable;
        $totalPayableConvertions +=$pendingPayableConvertions;

        $goldCoins = User::sum('gold_coin');
        $silverCoins = User::sum('silver_coin');
        $silverCoinsConvertions = $silverCoins * $convertionRate;
        $badges = Subscription::count();
        $offers = Offer::where('valid_till', '>', Carbon::now())->count();
        $purchase = Purchase::count();
        $subscriptionBadges = Subscription::all();
        $GIFT_URL = env('GIFT_URL');
        $reportedUsers=Report::count();
---
select sum(`gold_coin`) as aggregate from `users` where `users`.`deleted_at` is null
select sum(`silver_coin`) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `subscriptions`
select count(*) as aggregate from `offers` where `valid_till` > '2022-04-13 15:54:17'
select count(*) as aggregate from `purchases`
select * from `subscriptions`
select count(*) as aggregate from `reports`