app/Http/Controllers/admin/LoginController.php

    public function login(Request $request)
    {
        $this->validate($request, [
            'email' => 'required',
            'password' => 'required'
        ]);

        $user = User::with('roles')->whereDoesntHave('roles', function ($query) {
            $query->where('name', 'User');
        })->where('email', $request->email)->first();
        if (!$user) {
            return back()->with('error', 'You do not have access to system user');
        }
        if (!Auth::attempt(['email' => $request->email, 'password' => $request->password])) {
            return back()->with('error', 'Provided credentials are not valid');
        }
        $bannedRecord = BannedUsers::where('banned_user', auth()->id())->latest()->first();
---
select * from `users` where not exists (select * from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `users`.`id` = `user_role`.`user_id` and `name` = 'User') and `email` = 'superadmin@gmail.com' and `users`.`deleted_at` is null limit 1
select `roles`.*, `user_role`.`user_id` as `pivot_user_id`, `user_role`.`role_id` as `pivot_role_id` from `roles` inner join `user_role` on `roles`.`id` = `user_role`.`role_id` where `user_role`.`user_id` in ('daca1f59-97a0-46b3-85a9-adef51c1d1b7')
select * from `banned_users` where `banned_user` = 'daca1f59-97a0-46b3-85a9-adef51c1d1b7' order by `created_at` desc limit 1