app/Http/Controllers/admin/PrivacyTermController.php

select * from `privacy_terms` where `shortcode` = 'TERM-En' limit 1
select * from `privacy_terms` where `shortcode` = 'TERM-Da' limit 1
---
    public function terms()
    {
        $termsEn = PrivacyTerms::where('shortcode', 'TERM-En')->first();
        $termsDa = PrivacyTerms::where('shortcode', 'TERM-Da')->first();

select * from `privacy_terms` where `shortcode` = 'PRIVACY-En' limit 1
select * from `privacy_terms` where `shortcode` = 'PRIVACY-Da' limit 1
---
    public function privacy()
    {
        $privacyEn = PrivacyTerms::where('shortcode', 'PRIVACY-En')->first();
        $privacyDa = PrivacyTerms::where('shortcode', 'PRIVACY-Da')->first();

select * from `privacy_terms` where `shortcode` = 'CONSENT-En' limit 1
select * from `privacy_terms` where `shortcode` = 'CONSENT-Da' limit 1
---
    public function consent()
    {
        $consentEn = PrivacyTerms::where('shortcode', 'CONSENT-En')->first();
        $consentDa = PrivacyTerms::where('shortcode', 'CONSENT-Da')->first();