app/Http/Controllers/admin/RolePermissionsController.php

    public function roleslist(Request $request){

        if ($request->ajax()) {
            $data = Role::where('name','!=','User')->get();
---
select * from `roles` where `name` != 'User'

    public function editRole($id){

        $permissions=Permission::all();
        $role=Role::findOrFail($id);
        $rolePermissions = DB::table("roles_permissions")->where("roles_permissions.role_id",$id)
            ->pluck('roles_permissions.permission_id')
            ->all();
---
select * from `permissions`
select * from `roles` where `roles`.`id` = '1' limit 1
select `roles_permissions`.`permission_id` from `roles_permissions` where `roles_permissions`.`role_id` = '1'

    public function updateRole(Request $request ,$id){
//        dd($request->permissions->id);
        $role=Role::findOrFail($id);
---
select * from `roles` where `roles`.`id` = '1' limit 1